Repository: uakostya/shift-mate
Catalog: src/locale/messages.*.xlf
Languages: uk

# setup.title
source: Create Shift Schedule
uk: Створити Графік Змін

# setup.description
source: Set up your work schedule and get a shareable link
uk: Налаштуйте свій робочий графік та отримайте посилання для обміну

# setup.name.label
source: Schedule Name (Optional)
uk: Назва Графіку (Опціонально)

# setup.name.placeholder
source: My Work Schedule
uk: Мій Робочий Графік

# setup.startDate.label
source: Start Date
uk: Дата Початку

# setup.startDate.error
source: Start date is required
uk: Дата початку обов'язкова

# setup.workDays.label
source: Working Days
uk: Робочі Дні

# setup.workDays.error
source: Number of working days must be between 1 and 365
uk: Кількість робочих днів має бути від 1 до 365

# setup.restDays.label
source: Rest Days
uk: Дні Відпочинку

# setup.restDays.error
source: Number of rest days must be between 1 and 365
uk: Кількість днів відпочинку має бути від 1 до 365

# setup.create.button
source: Create Schedule
uk: Створити Графік

# setup.success.title
source: Schedule Created Successfully!
uk: Графік Успішно Створено!

# setup.success.url.label
source: Schedule URL:
uk: Посилання на Графік:

# setup.success.copy.button
source: Copy
uk: Копіювати

# setup.success.view.button
source: View Schedule
uk: Переглянути Графік

# setup.success.new.button
source: Create New
uk: Створити Новий

# calendar.error.title
source: Invalid Schedule Parameters
uk: Неправильні Параметри Графіку

# calendar.error.description
source: The schedule parameters in the URL are invalid or missing.
uk: Параметри графіку в URL неправильні або відсутні.

# calendar.error.button
source: Create New Schedule
uk: Створити Новий Графік

# calendar.previous.month
source: Previous month
uk: Попередній місяць

# calendar.next.month
source: Next month
uk: Наступний місяць

# calendar.legend.working
source: Working Day
uk: Робочий День

# calendar.legend.off
source: Day Off
uk: Вихідний

# calendar.actions.new
source: Create New Schedule
uk: Створити Новий Графік

# calendar.actions.share
source: Share Schedule
uk: Поділитися Графіком
